In [1]:
# Database operation
# 1. Create a database and create a table
import sqlite3
connection = sqlite3.connect('test11.db')
print("Opened database successfully....")
connection.execute('''CREATE TABLE student11
                   (stud_roll INTEGER PRIMARY KEY NOT NULL,
                   stud_name TEXT);''')
print("Table created successfully....")
#connection.close()

Opened database successfully....
Table created successfully....

In [2]:
# 2. Insert data into the table

connection = sqlite3.connect('test11.db')
print("Opened database successfully....")
connection.execute("INSERT INTO student11(stud_roll,stud_name)\
VALUES(1,'Abcd')");
connection.execute("INSERT INTO student11(stud_roll,stud_name)\
VALUES(2,'Efgh')");
connection.commit()
print("Records created successfully....")
#connection.close()

Opened database successfully....
Records created successfully....

In [3]:
# 3. Display the data from the table
   
cursor = connection.execute("SELECT stud_roll,stud_name from student11")
for row in cursor:
    print("Student Roll = ",row[0])
    print("Student Name = ",row[1],"\n")
print("Data displayed successfully....")
#connection.close()

Student Roll =  1
Student Name =  Abcd

Student Roll =  2
Student Name =  Efgh

Data displayed successfully....

In [4]:
# 4. Update the record
cursor = connection.execute("UPDATE student11 set stud_name = 'Avik' where stud_roll = 1")
print("Total number of rows updated:",connection.total_changes)
cursor = connection.execute("SELECT stud_roll,stud_name from student11")
for row in cursor:
    print("Student Roll = ",row[0])
    print("Student Name = ",row[1],"\n")
print("Data updated successfully....")
connection.close()

Total number of rows updated: 3
Student Roll =  1
Student Name =  Avik

Student Roll =  2
Student Name =  Efgh

Data updated successfully....